cpp_sl.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-02-28 Wed 21:24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>C++ - 标准库</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">C++ - 标准库</h1>
<p>
本文是阅读 <i>Professional C++, third edition</i> 中文版<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>的读书笔记.
</p>

<p>
C++标准库的核心是泛型容器和泛型算法. 包括<a href="./cpp_stl.html">标准模板库(Standard Template Library, STL)</a>.
</p>

<p>
所有标准库类和函数都在 <code>std</code> 名称空间中声明. 包括如下组件:
</p>
<dl class="org-dl">
<dt>字符串</dt><dd>定义在头文件 <code>&lt;string&gt;</code> 中的 <code>string</code> 类.</dd>
<dt>正则表达式</dt><dd>定义在头文件 <code>&lt;regex&gt;</code>.</dd>
<dt>I/O流</dt><dd>定义在头文件 <code>&lt;fstream&gt;</code>, <code>&lt;iomanip&gt;</code>, <code>&lt;ios&gt;</code>, <code>&lt;iosfwd&gt;</code>, <code>&lt;iostream&gt;</code>, <code>&lt;istream&gt;</code>, <code>&lt;ostream&gt;</code>, <code>&lt;sstream&gt;</code>, <code>&lt;streambuf&gt;</code> 和 <code>&lt;strstream&gt;</code> 中.</dd>
<dt>智能指针</dt><dd>定义在头文件 <code>&lt;memory&gt;</code> 中的 <code>unique_ptr</code>, <code>shared_ptr</code>, <code>weak_ptr</code>.</dd>
<dt>异常</dt><dd>定义在头文件 <code>&lt;exception&gt;</code>, <code>&lt;stdexcept&gt;</code> 和 <code>&lt;system_error&gt;</code>.</dd>
<dt>数学工具</dt><dd><ul class="org-ul">
<li>定义在头文件 <code>&lt;complex&gt;</code> 中的复数类 <code>complex</code>.</li>
<li>定义在头文件 <code>&lt;ratio&gt;</code> 中的有理数运算库.</li>
<li>定义在头文件 <code>&lt;valarray&gt;</code> 中的 <code>valarray</code> 类(与 <code>vector</code> 类类似, 但是对高性能数值应用做了特别的优化).</li>
<li>定义在头文件 <code>&lt;limits&gt;</code> 中的 <code>numeric_limits</code> 类模板, 如
<ul class="org-ul">
<li><code>numeric_limits&lt;int&gt;::max()</code></li>
<li><code>numeric_limits&lt;int&gt;::min()</code></li>
<li><code>numeric_limits&lt;int&gt;::lowest()</code></li>
<li><code>numeric_limits&lt;double&gt;::max()</code></li>
<li><code>numeric_limits&lt;double&gt;::min()</code></li>
<li><code>numeric_limits&lt;double&gt;::lowest()</code></li>
</ul></li>
</ul></dd>
<dt>时间工具</dt><dd>定义在头文件 <code>&lt;chrono&gt;</code> 中的 <code>Chrono</code> 库.</dd>
<dt>随机数</dt><dd>定义在头文件 <code>&lt;random&gt;</code> 中的随机数库.</dd>
<dt>初始化列表</dt><dd>定义在头文件 <code>&lt;initializer_list&gt;</code> 中的初始化列表(用于编写参数数目可变的函数).</dd>
<dt><code>Pair</code></dt><dd>定义在头文件 <code>&lt;utility&gt;</code> 中的 <code>pair</code> 模板, 用于存储两种不同类型的元素. 这称为存储异构元素.</dd>
<dt><code>Tuple</code></dt><dd>定义在头文件 <code>&lt;tuple&gt;</code> 中的 <code>tuple</code> 是 <code>pair</code> 的一种泛化, 它是固定大小的序列, 元组的元素可以是异构的, 其实例化的元素数目和类型在编译时固定不变.</dd>
<dt>函数对象</dt><dd>实现了函数调用运算符的类的对象称为函数对象. 函数对象可以用作某些STL算法的谓词. 头文件 <code>&lt;functional&gt;</code> 定义了一些预定义的函数对象, 支持根据已有的函数对象创建新函数对象.</dd>
<dt>多线程</dt><dd><ul class="org-ul">
<li>单个线程可以用头文件 <code>&lt;thread&gt;</code> 中的 <code>thread</code> 类创建.</li>
<li>定义在头文件 <code>&lt;atomic&gt;</code> 中的原子性提供了对一段数据的线程安全的原子访问.</li>
<li><code>&lt;condition_variable&gt;</code> 和 <code>&lt;mutex&gt;</code> 提供了其他线程同步机制.</li>
<li>如果只需计算某个数据得到结果, 并具有相应的异常处理, 使用定义在头文件 <code>&lt;future&gt;</code> 中的 <code>async</code> 和 <code>future</code> 要比直接使用 <code>thread</code> 类更容易.</li>
</ul></dd>
<dt>类型特质</dt><dd>定义在头文件 <code>&lt;type_traits&gt;</code> 中的类型特质提供了编译期间的类型信息. 编写高级模板时可以使用它.</dd>
</dl>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Marc Gregoire著, 张永强译. C++高级编程(第3版), 清华大学出版社, 2015.
</p></div></div>


</div>
</div></div>
</body>
</html>
